<?php

namespace App;

use App\Phone;
use Illuminate\Database\Eloquent\Model;


class User extends Model
{
    protected $guarded = [];
    // =====================================================
    // СВЯЗЬ ОДИН К ОДНОМУ
    // У одного обьекта User только один обьект Phone
    //======================================================
    public function phone(){

        return $this->hasOne(Phone::class);
    }

    // =====================================================
    // СВЯЗЬ ОДИН ЧЕРЕЗ ОТНОШЕНИЯ
    // Мы можем получить информацию о одном Owner, через таблицу Phone
    // В одного пользователя есть один телефон, а у телефона есть один разрабов
    //======================================================
    public function phoneOwner(){
        return $this->hasOneThrough(Owner::class, Phone::class);
    }

    // =====================================================
    // СВЯЗЬ МНОГИЕ ЧЕРЕЗ ОТНОШЕНИЯ
    // Мы можем получить информацию о многих Owner, через таблицу Phone
    // В одного пользователя есть несколько телефонов, а у телефона есть несколько разрабов
    //======================================================
    public function phoneOwners(){
        return $this->hasManyThrough(Owner::class, Phone::class);
    }

    // =====================================================
    // СВЯЗЬ МНОГИЕ КО МНОГИМ
    // Мы можем получить информацию о ролях, через таблицу role_user
    // В одного пользователя есть несколько телефонов, а у телефона есть несколько разрабов
    //======================================================
    public function role(){
        return $this->belongsToMany(Role::class, 'role_user');
    }
}
